[
    "Throughout my journey in computer science, I have been driven by curiosity and a desire to take on meaningful challenges. My recent internship at Kyanon Digital was a turning point, where I got to push the boundaries of AI to solve real-world problems, like improving customer profiling with representation learning. The days and nights were worth it in the end, as I have managed to improve on the existing solution of the company by over 20%! This experience taught me the importance of diving deep into complex problems and the power of innovative thinking to unlock better solutions. ",
    "I have always been fascinated by the potential of AI to revolutionize industries, and my work at Kyanon Digital has been a testament to that. I developed a proof-of-concept that addressed cold-start and knowledge transfer problems, significantly boosting the performance of baseline models like XGBoost. This project was a great learning experience for me, as I got to work with cutting-edge technologies and collaborate with a team of talented individuals. It was a challenging yet rewarding experience that has fueled my passion for AI and machine learning.",
    "Beyond my internship, I am involved in a research group at the RANCS Lab, where I am helping to develop an autonomous vehicle. While the technical side of this project has been fascinating-working with everything from sensor fusion to C++ libraries-what excites me most is the collaboration aspect. Because this is such a huge project, I have gotten to work with so many brilliant mechanical engineers that I wouldn't have the chance to interact with otherwise. It has been a lesson in how different skill sets and perspectives come together to solve problems that no one person could tackle alone. This emphasis on teamwork is one of the reasons I am drawn to [Company Name], as I admire the collaborative, cross-functional nature of your projects.",
    "On a personal level, I have always been a bit obsessed with coding challenges. What started as a goal to solve 100 problems quickly snowballed into solving over 400, and I am currently on a 115-day streak. I think this reflects how much I enjoy pushing myself to get better and solve problems efficiently. But beyond the numbers, what I have learned is how to approach problems systematically-breaking them down into manageable parts and looking for creative, optimized solutions.",
    "I am also really passionate about Linux and open-source software. It has been my go-to environment for years, and I am finally at the point where I want to give back by contributing to the projects I have relied on. Learning the internals of systems I have been using has not only deepened my technical understanding but also solidified my appreciation for the open-source community. I hope to bring this mindset of collaboration and contribution to the teams I work with.",
    "In addition to coding and open-source, I have been working on a few side projects to help local businesses improve their digital presence. One of the highlights has been collaborating with An Thai Duong Maritime to enhance their online reach. It has been a rewarding experience to apply my technical skills outside of the classroom and internship settings, directly impacting their customer engagement.",
    "At the heart of all my work is a love for solving problems, learning, and contributing to the bigger picture. I am excited about the possibility of bringing my experience and enthusiasm to your team, and I would love the chance to discuss how I can contribute to the innovative work happening at [Company Name]."
]